drafter-supports-multiple-kvcache-groups/logs/qwen3-32b-spec-main-c1-run1.log
WARNING 02-04 13:48:58 [__init__.py:144] xccl is not enabled in this torch build, communication is not available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f28e46e8900>, seed=0, num_prompts=50, dataset_name='hf', no_stream=False, dataset_path='philschmid/mt-bench', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split='test', hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen/Qwen3-32B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/home/shadeform/code/vllm-scripts/drafter-supports-multiple-kvcache-groups/results/qwen3-32b-spec-main-c1-run1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-5ce83d6c-', top_p=1.0, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [02:51<00:00,  3.43s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  171.59    
Total input tokens:                      3703      
Total generated tokens:                  12759     
Request throughput (req/s):              0.29      
Output token throughput (tok/s):         74.36     
Peak output token throughput (tok/s):    28.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          95.94     
---------------Time to First Token----------------
Mean TTFT (ms):                          59.31     
Median TTFT (ms):                        52.02     
P99 TTFT (ms):                           188.99    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.21     
Median TPOT (ms):                        13.10     
P99 TPOT (ms):                           16.57     
---------------Inter-token Latency----------------
Mean ITL (ms):                           36.54     
Median ITL (ms):                         36.82     
P99 ITL (ms):                            39.92     
---------------Speculative Decoding---------------
Acceptance rate (%):                     60.40     
Acceptance length:                       2.81      
Drafts:                                  4543      
Draft tokens:                            13629     
Accepted tokens:                         8232      
Per-position acceptance (%):
  Position 0:                            76.36     
  Position 1:                            58.57     
  Position 2:                            46.27     
==================================================